tutorials/reactingFoam/shearlayer/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

refmapping
{
    active          true;
    mixtureFractionProperties
    {
        oxidizerMassFractions
        {
            N2              0.77;
            O2              0.23;
        }
        fuelMassFractions
        {
            NC12H26           1;
        }
        #include        "$FOAM_CASE/constant/foam_mech_files/thermo.foam"
    }
    tolerance       0.0001;
}

loadbalancing
{
	active	true;
	log	true;
}
chemistryType
{
    solver          ode_pyJac;
    method          loadBalanced_pyJac;
}

chemistry       on;

initialChemicalTimeStep 1;

odeCoeffs
{
    solver          seulex_LAPACK;
    absTol          1e-08;
    relTol          1e-05;
}
#include "$FOAM_CASE/constant/reactionsYao"
// ************************************************************************* //
